app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("city", "latitude", "longitude", "max_capacity", "name", "state", "street_1", "street_2", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)